<a href="https://colab.research.google.com/github/mugdhav/IBMCert/blob/master/Data_Cleaning_SelfExcercise.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import io
import numpy as np

In [2]:
from google.colab import files
uploaded = files.upload()

Saving example.csv to example.csv

In [3]:
df_disney = pd.read_csv("example.csv")
df_disney
#df_disney.describe(include='all')

     Name Last Name Gender   Age
0  mickey     mouse      m  23.0
1  donald      duck      m  25.0
2   daisy      duck      f   NaN
3  minnie     mouse      f  30.0

In [5]:
mean_age = df_disney['Age'].mean()
print(mean_age)
print(np.nan)
print(df_disney['Age'][2])
df_updated = df_disney['Age'].replace(np.nan, mean_age, inplace=True) #inplace is necessary to replace value within the dataframe,/else replace doesn't work as expected
#df_updated
df_disney

26.0
nan
nan

     Name Last Name Gender   Age
0  mickey     mouse      m  23.0
1  donald      duck      m  25.0
2   daisy      duck      f  26.0
3  minnie     mouse      f  30.0

In [0]:
help(df_disney.replace)

In [0]:
df_disney.dropna(subset=['Age'], axis=0)

     Name Last Name Gender   Age
0  mickey     mouse      m  23.0
1  donald      duck      m  25.0
3  minnie     mouse      f  30.0

In [6]:
df_disney['Age'] = df_disney['Age'].astype(int) #Astype use format1  valid
df_disney

     Name Last Name Gender  Age
0  mickey     mouse      m   23
1  donald      duck      m   25
2   daisy      duck      f   26
3  minnie     mouse      f   30

In [7]:
df_disney[['Age']] = df_disney[['Age']].astype("float") #Astype use format2  valid
df_disney

     Name Last Name Gender   Age
0  mickey     mouse      m  23.0
1  donald      duck      m  25.0
2   daisy      duck      f  26.0
3  minnie     mouse      f  30.0

In [9]:
df_disney['Age'][1].dtype

dtype('float64')